---
type: Dimension
namespace: Autodesk.Revit.DB
version: 2024
members: 28
tags: [revit-api, class]
---

# Dimension

`Autodesk.Revit.DB.Dimension` · Revit 2024 · 28 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | HasOneSegment | 2021.1 | `public bool HasOneSegment ()` |
| Method | IsTextPositionAdjustable | 2015 Subscription Update | `public bool IsTextPositionAdjustable ()` |
| Method | ResetTextPosition | — | `public void ResetTextPosition ()` |
| Property | Above | — | `public string Above { get ; set ; }` |
| Property | AreReferencesAvailable | 2019 | `public bool AreReferencesAvailable { get ; }` |
| Property | AreSegmentsEqual | — | `public bool AreSegmentsEqual { get ; set ; }` |
| Property | Below | — | `public string Below { get ; set ; }` |
| Property | Curve | — | `public Curve Curve { get ; }` |
| Property | DimensionShape | — | `public DimensionShape DimensionShape { get ; }` |
| Property | DimensionType | — | `public DimensionType DimensionType { get ; set ; }` |
| Property | FamilyLabel | 2014 | `public FamilyParameter FamilyLabel { get ; set ; }` |
| Property | HasLeader | 2021.1 | `public bool HasLeader { get ; set ; }` |
| Property | IsLocked | — | `public bool IsLocked { get ; set ; }` |
| Property | IsValid | 2019 | `public bool IsValid { get ; }` |
| Property | LeaderEndPosition | 2015 Subscription Update | `public XYZ LeaderEndPosition { get ; set ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |
| Property | NumberOfSegments | — | `public int NumberOfSegments { get ; }` |
| Property | Origin | 2015 Subscription Update | `public XYZ Origin { get ; }` |
| Property | Parameter | — | `` |
| Property | Prefix | — | `public string Prefix { get ; set ; }` |
| Property | References | — | `public ReferenceArray References { get ; }` |
| Property | Segments | — | `public DimensionSegmentArray Segments { get ; }` |
| Property | Suffix | — | `public string Suffix { get ; set ; }` |
| Property | TextPosition | 2015 Subscription Update | `public XYZ TextPosition { get ; set ; }` |
| Property | Value | — | `public Nullable < double > Value { get ; }` |
| Property | ValueOverride | — | `public string ValueOverride { get ; set ; }` |
| Property | ValueString | — | `public string ValueString { get ; }` |
| Property | View | — | `public View View { get ; }` |